/**
 * 统一错误代码定义
 */
export const ErrorCodeMap = {
  // token相关
  11001: '登录无效或无权限访问',
  11002: '登录身份已过期',
  11003: '无权限，请联系管理员申请权限',
  11005: '登陆失败！',
  // 订单相关
  11004: '订单创建失败，请勿重复下单！',
  10001: '顺丰服务异常',
  10002: '顺丰下单失败',
  10003: '查询下单结果失败',
  10004: '取消顺丰订单失败',
  10005: '查询顺丰订单路由信息失败',
  10006: '订单不属于待确认状态，无法操作报价',
  10007: '订单不属于待取件状态，无法取消',
  10008: '订单回收价小于等于500，无法进行上门回收',
  10009: '该区域暂不支持上门回收',
  10010: '订单不属于当前用户，无法操作',
  10011: '订单不属于待确认或者待取件状态，无法取消',
  10012: '回收类目不是手机或者平板，无法进行上门回收',
  // open-api相关
  12001: '订单状态码错误',
  12002: '取件时间非法',
  12003: '打款账户信息不全',
  12004: '订单不存在',
  12005: '取件手机号非法',
  12010: '',

  // 20000是基础服务的错误码
  21001: '地址过多，最多30个',
  21002: '支付宝账户格式不对',
  21003: '手机号码格式不对',
  21004: '真实姓名不能为空',
  21005: '最大输入不能超过60个字符',
  21006: '您无权限',
  21007: '输入的内容不能为空',
  21008: '输入不能超出指定字节',

  // 30000是估价+订单模块的错误码
  30001: '类目不存在',
  30002: '型号不存在',
  30003: '问题不存在',
  30004: '当前问题和当前型号不匹配',
  30005: '答案不存在',
  30006: '当前答案和当前型号不匹配',
  30007: '问题重复',
  30008: '答案重复',
  30009: '该型号暂无报价，请联系客服',
  30010: '答案必须为数组格式',
  30011: '单选问题的答案必须为1个',
  30012: '有答案不允许回收，无法进行估价',
  30013: '问题列表路径错误，请检查程序逻辑',
  // ''
  // 40000 门店入驻错误码
  40001: '该门店已入驻',
  40002: '该门店入驻中，请勿重复提交',
  40003: '联系电话已被其他门店使用',
  40004: '请勿重复提交',
  40005: '门店名称已被使用，请适当修改',
  // 5开头为 门店商品的错误码
  50001: '门店ID不存在',
  // 6开头为 门店余额的错误码
  60001: '商家余额小于当前支付款+500元，无法交易，请商家先充值余额',
  // 100000开始是开放平台模块的报错
  100001: '鉴权失败，无权限访问',
} as const;

export type ErrorCodeMapType = keyof typeof ErrorCodeMap;
